iabdalkader/stm32f4xx/FatFS/src/diskio.c
/*-----------------------------------------------------------------------*/
/* MMC/SDSC/SDHC (in SPI mode) control module for STM32 Version 1.1.6    */
/* (C) Martin Thomas, 2010 - based on the AVR MMC module (C)ChaN, 2007   */
/*-----------------------------------------------------------------------*/

/* Copyright (c) 2010, Martin Thomas, ChaN
   All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:

   * Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   * Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in
     the documentation and/or other materials provided with the
     distribution.
   * Neither the name of the copyright holders nor the names of
     contributors may be used to endorse or promote products derived
     from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
  POSSIBILITY OF SUCH DAMAGE. */

#include <stdbool.h>
#include <stm32f4xx.h>
#include <stm32f4xx_rcc.h>
#include <stm32f4xx_spi.h>
#include <stm32f4xx_gpio.h>
#include "ffconf.h"
#include "diskio.h"

typedef bool BOOL;

#ifndef FALSE
    #define FALSE false
#endif
#ifndef TRUE
    #define TRUE true
#endif

#ifdef STM32_SD_USE_DMA
// #warning "Information only: using DMA"
#pragma message "*** Using DMA ***"
#endif

/* set to 1 to provide a disk_ioctrl function even if not needed by the FatFs */
#define STM32_SD_DISK_IOCTRL_FORCE      0

#define CARD_SUPPLY_SWITCHABLE   0
#define SOCKET_WP_CONNECTED      0 /* write-protect socket-switch */
#define SOCKET_CP_CONNECTED      1 /* card-present socket-switch */
#define DMA_Channel_SPIx_RX    DMA1_Channel4
#define DMA_Channel_SPIx_TX    DMA1_Channel5
#define DMA_FLAG_SPIx_TC_RX    DMA1_FLAG_TC4
#define DMA_FLAG_SPIx_TC_TX    DMA1_FLAG_TC5

#define GPIO_SPI_AF         GPIO_AF_SPI2

#define GPIO_PIN_CP         GPIO_Pin_0
#define GPIO_PIN_CS         GPIO_Pin_1
#define GPIO_PIN_SCLK       GPIO_Pin_10
#define GPIO_PIN_MISO       GPIO_Pin_2
#define GPIO_PIN_MOSI       GPIO_Pin_3

#define GPIO_SOURCE_MISO    GPIO_PinSource2
#define GPIO_SOURCE_MOSI    GPIO_PinSource3
#define GPIO_SOURCE_SCLK    GPIO_PinSource10

#define GPIO_PORT_CP        GPIOC 
#define GPIO_PORT_CS        GPIOC
#define GPIO_PORT_SCLK      GPIOB
#define GPIO_PORT_MISO      GPIOC
#define GPIO_PORT_MOSI      GPIOC

#define GPIO_CLK_CP         RCC_AHB1Periph_GPIOC
#define GPIO_CLK_CS         RCC_AHB1Periph_GPIOC
#define GPIO_CLK_SCLK       RCC_AHB1Periph_GPIOB
#define GPIO_CLK_MISO       RCC_AHB1Periph_GPIOC
#define GPIO_CLK_MOSI       RCC_AHB1Periph_GPIOC

#define SPIx                SPI2
#define SPIx_CLK            RCC_APB1Periph_SPI2
#define SPIx_CLK_CMD        RCC_APB1PeriphClockCmd
#define GPIO_CLK_CMD        RCC_AHB1PeriphClockCmd

/* for SPI2 and full-speed APB1: 36MHz/2 */
/* !! PRESCALE 4 used here - 2 does not work, maybe because
      of the poor wiring on the HELI_V1 prototype hardware */
#define SPI_BaudRatePrescaler_SPIx  SPI_BaudRatePrescaler_4

/* Definitions for MMC/SDC command */
#define CMD0	(0x40+0)	/* GO_IDLE_STATE */
#define CMD1	(0x40+1)	/* SEND_OP_COND (MMC) */
#define ACMD41	(0xC0+41)	/* SEND_OP_COND (SDC) */
#define CMD8	(0x40+8)	/* SEND_IF_COND */
#define CMD9	(0x40+9)	/* SEND_CSD */
#define CMD10	(0x40+10)	/* SEND_CID */
#define CMD12	(0x40+12)	/* STOP_TRANSMISSION */
#define ACMD13	(0xC0+13)	/* SD_STATUS (SDC) */
#define CMD16	(0x40+16)	/* SET_BLOCKLEN */
#define CMD17	(0x40+17)	/* READ_SINGLE_BLOCK */
#define CMD18	(0x40+18)	/* READ_MULTIPLE_BLOCK */
#define CMD23	(0x40+23)	/* SET_BLOCK_COUNT (MMC) */
#define ACMD23	(0xC0+23)	/* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24	(0x40+24)	/* WRITE_BLOCK */
#define CMD25	(0x40+25)	/* WRITE_MULTIPLE_BLOCK */
#define CMD55	(0x40+55)	/* APP_CMD */
#define CMD58	(0x40+58)	/* READ_OCR */

/* Card-Select Controls  (Platform dependent) */
#define SELECT()        GPIO_ResetBits(GPIO_PORT_CS, GPIO_PIN_CS)    /* MMC CS = L */
#define DESELECT()      GPIO_SetBits(GPIO_PORT_CS, GPIO_PIN_CS)      /* MMC CS = H */

/* Manley EK-STM32F board does not offer socket contacts -> dummy values: */
#define SOCKPORT	1			/* Socket contact port */
#define SOCKWP		0			/* Write protect switch (PB5) */
#define SOCKINS		0			/* Card detect switch (PB4) */

#if (_MAX_SS != 512) || (_FS_READONLY == 0) || (STM32_SD_DISK_IOCTRL_FORCE == 1)
#define STM32_SD_DISK_IOCTRL   1
#else
#define STM32_SD_DISK_IOCTRL   0
#endif

/*--------------------------------------------------------------------------

   Module Private Functions and Variables

---------------------------------------------------------------------------*/

static const DWORD socket_state_mask_cp = (1 << 0);
static const DWORD socket_state_mask_wp = (1 << 1);

static volatile
DSTATUS Stat = STA_NOINIT;	/* Disk status */

static volatile
DWORD Timer1, Timer2;	/* 100Hz decrement timers */

static
BYTE CardType;			/* Card type flags */

static int powered=0;

